Manoharkuduchella/Manohar_BitLearn/Bitlearn_workspace/Microcontrollers/STM32/stm32l4_workspace_hal/2_UartTx_Polling/Src/main.c
#include "stm32l4xx_hal.h"
#include "stm32l4xx_hal_rcc.h"

void SysTick_Handler(void);
void uart2_init(void);

//UART <-> APB1

UART_HandleTypeDef huart2;

char message[20] = "Hello form STM32\r\n";

int main() {
	HAL_Init();
	uart2_init();

	while (1) {
		HAL_UART_Transmit(&huart2, (uint8_t*) message, 20, 100);
		HAL_Delay(10);
	}
}

void SysTick_Handler(void) {
	HAL_IncTick();
}

void uart2_init(void) {

	GPIO_InitTypeDef GPIO_InitStruct = { 0 };
	//enable UART pins clock access
	__HAL_RCC_GPIOA_CLK_ENABLE();

	//Enable UART module clock access
	__HAL_RCC_USART2_CLK_ENABLE();

	//Configure pins to act as alternate func pins(UART)
	GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
	//GPIO_AF7_USART3
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	//configure UART module
	huart2.Instance = USART2;
	huart2.Init.BaudRate = 9600;
	huart2.Init.WordLength = UART_WORDLENGTH_8B;
	huart2.Init.StopBits = UART_STOPBITS_1;
	huart2.Init.Parity = UART_PARITY_NONE;
	huart2.Init.Mode = UART_MODE_TX;
	huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart2.Init.OverSampling = UART_OVERSAMPLING_16;
	//HwFlowCtl and Oversampling not present

	HAL_UART_Init(&huart2);

}

